<?php

// +----------------------------------------------------------------------
// | H1CMS © OpenSource CMS
// +----------------------------------------------------------------------
// | Copyright (c) 2014-2016 http://www.h1cms.com All rights reserved.
// | Copyright (c) 2014-2016 嘉兴领格信息技术有限公司，并保留所有权利。
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: Allen <allen@getw.com>
// +----------------------------------------------------------------------


return [
    // +----------------------------------------------------------------------
    // | 系统默认使用文件缓存(Config)
    // +----------------------------------------------------------------------
    'default'=>'file',
    'file' => [
        'path' => ROOT_PATH . DS . 'storage/cache',
        'filePermissions' => 0660,
        'dirPermissions' => 0770,
        'dirSplit' => 2,
        'memKeyLimit' => 20,
        'keyHashFunction' => 'md5',
    ],
    'memcache' => [
        'servers' => [
            ['host' => '127.0.0.1', 'port' => 11211, 'weight' => 1]
        ],
        'keycache_limit' => 1
    ],
    'redis' => [
        'servers' => [
            'server' => '127.0.0.1',
            'port' => '6379',
            'ttl' => 0.1,
            /**
             * 'password'=>'',
             * 'socket'=>'/tmp/redis.sock'
             */
        ]
    ]
];
